fio/results/libpmem_d32_cpu0_memdefault_split.txt
libpmem-randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-randwrite: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-seqwrite: (g=2): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-seqread: (g=3): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
fio-3.6-5-gf31fe
Starting 128 processes
libpmem-randread: Laying out IO file (1 file / 256MiB)
libpmem-randread: Laying out IO file (1 file / 256MiB)
libpmem-randread: Laying out IO file (1 file / 256MiB)
[...]
libpmem-randwrite: Laying out IO file (1 file / 256MiB)
libpmem-randwrite: Laying out IO file (1 file / 256MiB)
libpmem-randwrite: Laying out IO file (1 file / 256MiB)
[...]
libpmem-seqwrite: Laying out IO file (1 file / 256MiB)
libpmem-seqwrite: Laying out IO file (1 file / 256MiB)
libpmem-seqwrite: Laying out IO file (1 file / 256MiB)
[...]
libpmem-seqread: Laying out IO file (1 file / 256MiB)
libpmem-seqread: Laying out IO file (1 file / 256MiB)
libpmem-seqread: Laying out IO file (1 file / 256MiB)
[...]
fio: ENOSPC on laying out file, stopping
libpmem-seqread: Laying out IO file (1 file / 256MiB)
fio: ENOSPC on laying out file, stopping
libpmem-seqread: Laying out IO file (1 file / 256MiB)
fio: ENOSPC on laying out file, stopping
libpmem-seqread: Laying out IO file (1 file / 256MiB)
fio: ENOSPC on laying out file, stopping
libpmem-seqread: Laying out IO file (1 file / 256MiB)
fio: ENOSPC on laying out file, stopping
libpmem-seqread: Laying out IO file (1 file / 256MiB)
fio: ENOSPC on laying out file, stopping
libpmem-seqread: Laying out IO file (1 file / 256MiB)
fio: ENOSPC on laying out file, stopping
libpmem-seqread: Laying out IO file (1 file / 256MiB)
fio: ENOSPC on laying out file, stopping
libpmem-seqread: Laying out IO file (1 file / 256MiB)
fio: ENOSPC on laying out file, stopping
libpmem-seqread: Laying out IO file (1 file / 256MiB)
fio: ENOSPC on laying out file, stopping

libpmem-randread: (groupid=0, jobs=32): err= 0: pid=22359: Thu Apr 19 15:04:11 2018
   read: IOPS=8326k, BW=31.8GiB/s (34.1GB/s)(953GiB/30002msec)
    clat (nsec): min=92, max=92019k, avg=3179.31, stdev=115468.70
     lat (nsec): min=117, max=92019k, avg=3252.08, stdev=116722.93
    clat percentiles (nsec):
     |  1.00th=[  876],  5.00th=[ 1288], 10.00th=[ 1512], 20.00th=[ 1800],
     | 30.00th=[ 2008], 40.00th=[ 2192], 50.00th=[ 2352], 60.00th=[ 2512],
     | 70.00th=[ 2704], 80.00th=[ 2896], 90.00th=[ 3248], 95.00th=[ 3536],
     | 99.00th=[ 4320], 99.50th=[ 4704], 99.90th=[ 6048], 99.95th=[16064],
     | 99.99th=[18816]
   bw (  KiB/s): min=126495, max=1390431, per=2.80%, avg=933640.79, stdev=266136.86, samples=1888
   iops        : min=31623, max=347607, avg=233409.82, stdev=66534.21, samples=1888
  lat (nsec)   : 100=0.01%, 250=0.04%, 500=0.11%, 750=0.35%, 1000=1.29%
  lat (usec)   : 2=27.67%, 4=68.64%, 10=1.84%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=74.98%, sys=0.02%, ctx=17061, majf=0, minf=46201
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=249794973,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-randwrite: (groupid=1, jobs=32): err= 0: pid=22391: Thu Apr 19 15:04:11 2018
  write: IOPS=6510k, BW=24.8GiB/s (26.7GB/s)(745GiB/30001msec)
    clat (nsec): min=309, max=68001k, avg=4265.56, stdev=131920.83
     lat (nsec): min=340, max=68001k, avg=4332.74, stdev=132874.04
    clat percentiles (nsec):
     |  1.00th=[  764],  5.00th=[ 1336], 10.00th=[ 1688], 20.00th=[ 2128],
     | 30.00th=[ 2480], 40.00th=[ 2768], 50.00th=[ 3088], 60.00th=[ 3408],
     | 70.00th=[ 3728], 80.00th=[ 4128], 90.00th=[ 4768], 95.00th=[ 5472],
     | 99.00th=[ 7008], 99.50th=[ 7712], 99.90th=[ 9280], 99.95th=[ 9920],
     | 99.99th=[12864]
   bw (  KiB/s): min=179314, max=1091329, per=2.96%, avg=770881.86, stdev=215015.80, samples=1888
   iops        : min=44828, max=272832, avg=192720.08, stdev=53753.93, samples=1888
  lat (nsec)   : 500=0.07%, 750=0.85%, 1000=1.37%
  lat (usec)   : 2=14.24%, 4=60.13%, 10=23.29%, 20=0.04%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=75.00%, sys=0.01%, ctx=17717, majf=0, minf=5340
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,195320455,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqwrite: (groupid=2, jobs=32): err= 0: pid=22423: Thu Apr 19 15:04:11 2018
  write: IOPS=6515k, BW=24.9GiB/s (26.7GB/s)(746GiB/30001msec)
    clat (nsec): min=289, max=40006k, avg=4290.53, stdev=131560.45
     lat (nsec): min=316, max=40006k, avg=4361.72, stdev=132736.33
    clat percentiles (nsec):
     |  1.00th=[  796],  5.00th=[ 1384], 10.00th=[ 1720], 20.00th=[ 2160],
     | 30.00th=[ 2480], 40.00th=[ 2800], 50.00th=[ 3088], 60.00th=[ 3408],
     | 70.00th=[ 3760], 80.00th=[ 4192], 90.00th=[ 4832], 95.00th=[ 5536],
     | 99.00th=[ 7136], 99.50th=[ 7776], 99.90th=[ 9408], 99.95th=[10048],
     | 99.99th=[13120]
   bw (  KiB/s): min=159843, max=1088820, per=2.12%, avg=552146.36, stdev=155113.52, samples=1888
   iops        : min=39960, max=272205, avg=138036.21, stdev=38778.38, samples=1888
  lat (nsec)   : 500=0.08%, 750=0.72%, 1000=1.21%
  lat (usec)   : 2=13.88%, 4=60.46%, 10=23.59%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=75.00%, sys=0.00%, ctx=17652, majf=0, minf=5265
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,195455570,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqread: (groupid=3, jobs=32): err= 0: pid=22456: Thu Apr 19 15:04:11 2018
   read: IOPS=15.2M, BW=57.8GiB/s (62.1GB/s)(1734GiB/30001msec)
    clat (nsec): min=123, max=112026k, avg=1443.45, stdev=73953.38
     lat (nsec): min=147, max=112026k, avg=1518.51, stdev=76316.72
    clat percentiles (nsec):
     |  1.00th=[  223],  5.00th=[  249], 10.00th=[  262], 20.00th=[  302],
     | 30.00th=[  422], 40.00th=[  628], 50.00th=[ 1032], 60.00th=[ 1352],
     | 70.00th=[ 1608], 80.00th=[ 1832], 90.00th=[ 2128], 95.00th=[ 2352],
     | 99.00th=[ 2832], 99.50th=[ 3024], 99.90th=[ 3632], 99.95th=[ 4048],
     | 99.99th=[17536]
   bw (  MiB/s): min=  272, max= 4637, per=3.12%, avg=1847.23, stdev=837.90, samples=1893
   iops        : min=69738, max=1187188, avg=472891.66, stdev=214501.89, samples=1893
  lat (nsec)   : 250=5.20%, 500=29.87%, 750=7.93%, 1000=5.98%
  lat (usec)   : 2=37.09%, 4=13.88%, 10=0.02%, 20=0.02%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=74.99%, sys=0.00%, ctx=17998, majf=0, minf=6002
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=454628344,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=31.8GiB/s (34.1GB/s), 31.8GiB/s-31.8GiB/s (34.1GB/s-34.1GB/s), io=953GiB (1023GB), run=30002-30002msec

Run status group 1 (all jobs):
  WRITE: bw=24.8GiB/s (26.7GB/s), 24.8GiB/s-24.8GiB/s (26.7GB/s-26.7GB/s), io=745GiB (800GB), run=30001-30001msec

Run status group 2 (all jobs):
  WRITE: bw=24.9GiB/s (26.7GB/s), 24.9GiB/s-24.9GiB/s (26.7GB/s-26.7GB/s), io=746GiB (801GB), run=30001-30001msec

Run status group 3 (all jobs):
   READ: bw=57.8GiB/s (62.1GB/s), 57.8GiB/s-57.8GiB/s (62.1GB/s-62.1GB/s), io=1734GiB (1862GB), run=30001-30001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%